---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.MEPNetworkIterator
source: html/9535f996-e7e1-ed86-4e4b-cdb37be98a8e.htm
---
# MEPNetworkIterator Properties

The element id at the current iteration step.